## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: oidc
**Success**: :thumbsup:
```

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: . | :heavy_multiplication_x:
**Dir**: .
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: run
**Success**: :thumbsup:
**Details**: `terraform init`
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v5.73.0...
- Installed hashicorp/aws v5.73.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :thumbsup:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.insecure_sg will be created
  + resource "aws_security_group" "insecure_sg" {
      + arn                    = (known after apply)
      + description            = "Security group with unrestricted SSH access"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "insecure-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "insecure-sg"
        }
      + tags_all               = {
          + "Name" = "insecure-sg"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
**Step**: run
**Success**: :heavy_multiplication_x:
**Details**: `conftest-wrapper`
```
FAIL - /tmp/tmp2rxf9x5f/plan.json - main - Security Group aws_security_group.insecure_sg has an ingress rule allowing unrestricted SSH access on port 22.

1 test, 0 passed, 0 warnings, 1 failure, 0 exceptions

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
